tiagobka/sjtwo-c/lpc40xx_freertos/l5_application/main.c
#include "FreeRTOS.h"
#include "task.h"

//#include "../l4_io/fatfs/ff13c/source/ff.h"
#include "cli_handlers.h"
#include "clock.h"
#include "delay.h"
#include "ff.h"
#include "globals.h"
#include "gpio.h"
#include "lpc40xx.h"
#include "lpc_peripherals.h"
#include "queue.h"
#include "semphr.h"
#include "sj2_cli.h"
#include "sl_string.h"
#include "uart_printf.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
void read_file_using_fatfs_pi(int value);
// void write_file_using_fatfs_pi(acceleration__axis_data_s);
// python nxp-programmer/flash.py --device COM4 -i _build_lpc40xx_freertos/lpc40xx_freertos.bin
// static QueueHandle_t values_queue;
// TaskHandle_t xHandlePlayer;

//-------------------------------------------
//---------------HANDLER-----------------------
//-------------------------------------------
app_cli_status_e cli__player_handler(app_cli__argument_t argument, sl_string_t user_input_minus_command_name,
                                     app_cli__print_string_function cli_output) {

  sl_string_t s = user_input_minus_command_name;
  uint16_t slenght = sl_string__get_length(s);

  if (slenght > LEN_OF_NAME) {
    printf("The file name is too big");
    return APP_CLI_STATUS__SUCCESS;
  }
  char c = (char)s[0];

  for (int i = 0; i < LEN_OF_NAME; i++) { // clears variable
    TBFILENAME[i] = (char)0;
  }

  for (int i = 0; i < slenght; i++) {
    TBFILENAME[i] = s[i];
  }
  // TBFILENAME = s;

  xQueueSend(MUSIC_NAME_QUEUE, &TBFILENAME, 100);
  //}
  // char c = '\n';
  // printf("%c", c);
  // xQueueSend(music_name, &c, 100);

  return APP_CLI_STATUS__SUCCESS;
}
//---------------------------------------------
//---------------HANDLER-----------------------
//---------------------------------------------

void reader(void *p) {
  FIL file; // File handle
  char filename[32];
  uint64_t fileSizeBytes = 0;
  UINT bytes_read = 0;
  UINT SumBytesRead;
  FILINFO fileInfo;

  while (1) {
    SumBytesRead = 0;

    xQueueReceive(MUSIC_NAME_QUEUE, &filename[0], portMAX_DELAY);
    // printf("reader function received: |%s|", filename);

    FRESULT result = f_open(&file, filename, FA_READ);

    if (FR_OK == result) { // opened file ok
      if (f_stat(filename, &fileInfo) == FR_OK) {
        printf("The File Size is: %d bytes\n", fileInfo.fsize);
        fileSizeBytes = fileInfo.fsize;
      }
      char data[512] = {0};
      while (SumBytesRead < fileSizeBytes) {
        if (FR_OK == f_read(&file, data, LEN_OF_DATA, &bytes_read)) {
          SumBytesRead += bytes_read;
          // printf("bytes read: %d out of %d\n", SumBytesRead, fileSizeBytes);
          xQueueSend(DATA_QUEUE, &data[0], portMAX_DELAY);
        } else {
          printf("failed to read");
        }
      }
      printf("file closed\n");
      f_close(&file);

    } else { // OPEN not OK
      printf("ERROR: Failed to open: %s\n", filename);
    }
  }
}

void player(void *p) {
  char data[512] = {0};
  while (1) {
    xQueueReceive(DATA_QUEUE, &data[0], portMAX_DELAY);
    for (int i = 0; i < strlen(data) && i < LEN_OF_DATA; i++) {
      putchar(data[i]);
      // printf("%c, %d", data[i], i);
    }
  }
}

int main(void) {
  sj2_cli__init();
  MUSIC_NAME_QUEUE = xQueueCreate(1, sizeof(TBFILENAME));
  DATA_QUEUE = xQueueCreate(1, LEN_OF_DATA);

  xTaskCreate(reader, "reader", (512U * 4) / sizeof(void *), NULL, PRIORITY_MEDIUM, NULL);
  xTaskCreate(player, "player", (512U * 4) / sizeof(void *), NULL, PRIORITY_MEDIUM, NULL);
  vTaskStartScheduler();
}

/*void read_file_using_fatfs_pi(int value) {
  FIL file; // File handle
  UINT bytes_read = 0;
  FRESULT result = f_open(&file, fileName, (FA_READ));
  if (FR_OK == result) {
    char string[512];
    if (FR_OK == f_read(&file, string, strlen(string), &bytes_read)) {
    } else {

      printf("ERROR: Failed to read data from file\n");
    }
    for (int i = 0; i < 512; i++) {
      printf("%c", string[i]);
    }
    f_close(&file);
  } else {
    printf("ERROR: Failed to open: %s\n", fileName);
  }
}*/
